Tekla Open API Reference for Tekla Structures 2025
MarkBase.GetObjectAlignedBoundingBox Method
 Returns the object aligned bounding box of the text (rectangle format).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public RectangleBoundingBox GetObjectAlignedBoundingBox()
Public Function GetObjectAlignedBoundingBox As RectangleBoundingBox
Return Value
Type: RectangleBoundingBox
The bounding box of the text.
Implements
IObjectAlignedBoundingBox.GetObjectAlignedBoundingBox()
See Also
Reference
MarkBase Class
Tekla.Structures.Drawing Namespace